In [182]:
from LandBase import *

# 주피터노트북 매직커맨드 혹은 매직키워드
# 구글에서 찾을 때는 "jupyter notebook Built-in magic commands"라고 찾으면 수월함
# %lsmagic : 사용 가능한 매직커맨드 목록
# %quickref : 사용 가능한 매직커맨드 목록과 설명 (quick reference)
# %prun : 주피터노트북에서 실행된 내용의 퍼포먼스 측정
# %time : 주피터노트북에서 실행된 내용의 시간 측정
# %pdb : 디버깅 목적으로 오류가 발생하면 그 위치에서 멈추게 함
# %load_ext : 외부 플러그인 가져오기

def apt_sell_info(p_ym='201510') :
    ####
    # 분양정보목록
    # 출처: http://www.drapt.com/e_sale/index.htm?page_name=cal&menu_key=0&item=3&view_type=month&today_date=년-월
    ####
    
    r_list = []
    url = 'http://www.drapt.com/e_sale/index.htm?page_name=cal&menu_key=0&item=3&view_type=month&today_date=' + p_ym[:4] + '-' + p_ym[4:]
    
    r = requests.get(url)
    soup = BeautifulSoup(r.text, 'lxml') # bs4.BeautifulSoup 타입
    # bs4.BeautifulSoup 타입에서 find 혹은 find_all만 한 결과는 bs4.element.ResultSet 타입이다.
    # soup.find_all('table', 'esale_cal_table3') = soup.find_all('table', class_='esale_cal_table3')
    # soup.find_all('table', class_='esale_cal_table3') : table 태그 중에서 class가 esale_cal_table3인 경우를 모두 찾음, bs4.element.ResultSet 타입
    # soup.find('table', 'esale_cal_table3').find_all('tr') : 위에서 찾은 결과에서 tr 태그를 가진 값 모두 찾음, bs4.element.ResultSet 타입
    for tr in soup.find('table', class_='esale_cal_table3').find_all('tr') :
        # tr.find('th').find('span', 'td_date').find('strong') : 위에 찾은 결과에서 th 태그 -> span태그 & class가 td_date이고 -> strong 태그
        # tr.find('th').find('span', 'td_date').find('strong').string : 위 결과에서 문자열로 된 값만 추출, bs4.element.NavigableString 타입, 여기서는 필요없으므로 안 찾음
        for li in tr.find_all('li', class_=False) :
            분양유형 = '민간분양'
            형태 = li.find('span').string.strip('[]')
            if 형태 == '오피스텔' : 
                continue # 오피스텔은 건너뛰기
            apt_nm = li.find('a')['title'].strip()
            if not apt_nm.startswith('서울') and not apt_nm.startswith('인천') and not apt_nm.startswith('경기') :
                continue # 서울, 인천, 경기 아니면 건너뛰기
            apt_no = re.findall('\d+', li.find('a')['href'])[0]
            if apt_nm.count('뉴스테이') :
                분양유형 = '뉴스테이'
                apt_nm = apt_nm.replace('뉴스테이', '')
            elif apt_nm.count('공공임대') :
                분양유형 = '공공임대'
                apt_nm = apt_nm.replace('공공임대', '')
            elif apt_nm.count('영구임대') :
                분양유형 = '영구임대'
                apt_nm = apt_nm.replace('영구임대', '')
            elif apt_nm.count('국민임대') :
                분양유형 = '국민임대'
                apt_nm = apt_nm.replace('국민임대', '')
            elif apt_nm.count('공공분양') :
                분양유형 = '공공분양'
                apt_nm = apt_nm.replace('공공분양', '')
            if apt_nm.endswith('순위') :
                apt_nm = apt_nm.rsplit(' ', 1)[0] # 오른쪽부터 1번만 분리
            apt_nm = apt_nm.replace('()', '').replace(',)', ')').replace(', )', ')')
            
            r_dict = apt_basic_info(apt_no) # 단지 기본정보 함수 호출
            if '입주시기' not in r_dict.keys() :
                r_dict['입주시기'] = str(int(p_ym[:4])+3) + p_ym[4:]
            if '특징' not in r_dict.keys() :
                r_dict['특징'] = ''
            
            r_list.append([p_ym, r_dict['입주시기'], 분양유형, 형태, apt_no, apt_nm, r_dict['주소'], r_dict['동수'], r_dict['가구수'], r_dict['최고층'], r_dict['특징']])
    
    df = pd.DataFrame(r_list, columns=['sell_ym', 'move_ym', 'sell_type', 'apt_type', 'apt_no', 'apt_nm', 'address', 'building_cnt', 'house_cnt', 'top_floor', 'characteristics'])
    df.drop_duplicates(inplace=True)
    return df
    
def apt_basic_info(p_no='39801') :
    ####
    # 단지기본 정보
    # 출처: http://www.drapt.com/sise/html_view5/total.php?no=단지번호
    # 정보: 최고층, 동수, 가구수, 입주시기, 주소, 특징
    ####
    
    r_dict = {'no':p_no}
    url = 'http://www.drapt.com/sise/html_view5/total.php?no=' + p_no

    r = requests.get(url)
    soup = BeautifulSoup(r.text, 'lxml') # bs4.BeautifulSoup 타입
    
    for tr in soup.find('table').find_all('tr') :
        th = tr.find_all('th')
        td = tr.find_all('td')
        for i in range(len(th)) :
            th_str = th[i].string.replace('\n', '').strip()
            td_str = td[i].contents[0].string.replace('\n', '').strip()
            if th_str == '단지규모' :
                r_dict['최고층'] = td_str.split()[0].split('~')[-1].replace('층', '')
                r_dict['동수'] = td_str.split()[1].replace('개동', '')
                r_dict['가구수'] = td_str.split()[-1].replace('총', '').replace('가구', '')
            elif th_str == '입주시기' :
                r_dict[th_str] = td_str.replace('년', '').replace('월', '').replace(' ', '')[:6]
            elif th_str in ['주소', '특징'] :
                r_dict[th_str] = td_str
    
    #display(r_dict)
    return r_dict

def apt_size_info(p_ym='201510', p_no='53685') :
    ####
    # 단지면적 정보
    # 출처: http://www.drapt.com/sise/html_view5/size_info.php?no=53685
    # 정보: 공급면적, 전용면적, 방/욕실, 가구수(임대)
    ####
    
    url = 'http://www.drapt.com/sise/html_view5/size_info.php?no=' + p_no

    fr_list = []
    r = requests.get(url)
    soup = BeautifulSoup(r.text, 'lxml') # bs4.BeautifulSoup 타입
    
    for tr in soup.find('table').find_all('tr') :
        r_list = []
        td = tr.find_all('td')
        if len(td) == 0 :
            continue
        r_list.append(p_ym)
        r_list.append(p_no)
        r_list.append(td[0].find('a', class_='area_big').contents[0]) # 공급면적
        r_list.append(td[1].find('span').contents[0].replace('㎡','')) # 전용면적
        r_list.append(td[5].string.split('/')[0]) # 방
        r_list.append(td[5].string.split('/')[1]) # 욕실
        house_cnt = rent_house_cnt = td[6].find('span').contents[0]
        house_cnt = house_cnt.split('(')[0]
        if len(house_cnt) == 0 :
            house_cnt = 0
        else :
            house_cnt = int(house_cnt)
        if len(rent_house_cnt.split('(')) == 1 : # 임대가구수가 없는 경우
            rent_house_cnt = 0 # 임대가구수
        else:
            rent_house_cnt = int(rent_house_cnt.split('(')[1].replace(')','')) # 임대가구수
        r_list.append(house_cnt) # 일반가구수
        r_list.append(rent_house_cnt) # 임대가구수
        
        fr_list.append(r_list)
    
    df = pd.DataFrame(fr_list, columns=['sell_ym', 'no', 'supply_area', 'priv_area', 'room_cnt', 'bath_cnt', 'house_cnt', 'rent_house_cnt'])
    display(df)

In [183]:
# DB Connection Open
#con = get_db_connection()

# 닥터아파트에서 월별 분양정보 가져오기
ym_list = get_ym_list('201510', '201510')
for ym in ym_list :
    df = apt_sell_info(ym)
    for apt_no in df['apt_no'] :
        print(ym, apt_no)
        apt_size_info(ym, apt_no)

# DB Connection Close
#disconnect_db(con)

print('Program Finised')

201510 39801

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,39801,85.16,59,3,2,0,160
1,201510,39801,101.85,74,3,2,0,928
2,201510,39801,115.18A,84,3,2,0,364
3,201510,39801,114.89C,84,3,2,0,94
4,201510,39801,115.40D,84,3,2,0,108
5,201510,39801,115.73B,84,3,2,0,746

201510 53386

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53386,34,21,,1,0,204
1,201510,53386,41,26,,1,0,198

201510 53685

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53685,82.55P,59,3,2,408,0
1,201510,53685,82.57TWA,59,3,2,177,0
2,201510,53685,82.55TWB,59,3,2,182,0
3,201510,53685,94.20TR,59,3,2,24,0
4,201510,53685,99.01P,72,3,2,96,0
5,201510,53685,115.36A,84,3,2,386,0
6,201510,53685,115.64B,84,3,2,386,0
7,201510,53685,115.57C,84,3,2,129,0
8,201510,53685,115.47D,84,3,2,490,0
9,201510,53685,115.54P,84,3,2,468,0
10,201510,53685,115.05P1,84,3,2,144,0
11,201510,53685,132.08A,97,4,2,262,0
12,201510,53685,132.08B,97,4,2,55,0
13,201510,53685,132.18C,97,3,2,55,0
14,201510,53685,138.54PH,101,4,2,4,0
15,201510,53685,140.47TR,84,3,2,6,0
16,201510,53685,148.63,109,4,2,64,0
17,201510,53685,161.96,120,4,2,32,0
18,201510,53685,194.06,141,3,2,4,0
19,201510,53685,223.15A,161,4,2,1,0
20,201510,53685,221.73B,161,4,2,1,0
21,201510,53685,263.29,192,4,2,1,0

201510 53684

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53684,114.97A,84,3,2,71,0
1,201510,53684,114.38B,84,3,2,192,0
2,201510,53684,128.66A,97,4,2,204,0

201510 53377

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53377,99.51A,75,3,2,0,194
1,201510,53377,111.45A,84,3,2,0,77
2,201510,53377,111.34B,84,3,2,0,125
3,201510,53377,111.43C,84,3,2,0,98
4,201510,53377,111.45D,84,3,2,0,806

201510 53741

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53741,42.48A,26,,0,0,213
1,201510,53741,58.31B,36,,0,0,39
2,201510,53741,74.74A,46,,0,0,150

201510 53363

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53363,47.18A,29,0,1,0,310
1,201510,53363,46.82A,29,,0,0,43
2,201510,53363,47.15B,29,,0,0,48
3,201510,53363,56.60A,36,,0,0,104
4,201510,53363,56.94A,36,0,1,0,193
5,201510,53363,56.74B,36,,0,0,23
6,201510,53363,58.06C,36,,0,0,33
7,201510,53363,72.41C,46,,0,0,24
8,201510,53363,72.99A,46,,0,0,20
9,201510,53363,72.99B,46,,0,0,14
10,201510,53363,73.51B,46,,0,0,54
11,201510,53363,73.01D,46,,0,0,6
12,201510,53363,87.34A,55,3,1,0,44

201510 53739

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53739,68.70,49,3,2,85,0
1,201510,53739,81.45A,59,3,2,38,0
2,201510,53739,81.85B,59,3,2,45,0
3,201510,53739,82.41C,59,3,2,57,0
4,201510,53739,113.96A,84,3,2,20,0
5,201510,53739,114.80B,84,3,2,138,0
6,201510,53739,115.55C,84,3,2,90,0
7,201510,53739,115.57D,84,3,2,93,0
8,201510,53739,142.24,106,,0,50,0
9,201510,53739,143.23A,106,,0,50,0
10,201510,53739,144.36B,106,,0,25,0
11,201510,53739,149.05,110,,0,27,0
12,201510,53739,178.65,133,4,2,38,0

201510 50982

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,50982,91.39A,66,3,2,257,0
1,201510,50982,91.50B,66,3,2,60,0
2,201510,50982,111.56A,84,3,2,87,0
3,201510,50982,112.22B,84,3,2,44,0

201510 53542

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53542,106.71A,80A,3,2,438,0
1,201510,53542,107.29B,80B,3,2,46,0
2,201510,53542,109.63,82,3,2,157,0
3,201510,53542,113.13A,84,3,2,10,0
4,201510,53542,113.22B,84,3,2,19,0
5,201510,53542,114.30C,84,3,2,3,0

201510 53595

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53595,100.63,76,3,2,392,0
1,201510,53595,110.32,84,3,2,406,0
2,201510,53595,131.12,100,4,2,184,0

201510 53391

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53391,85.11A,59,3,2,0,1063
1,201510,53391,85.03B,59,3,2,0,165

201510 53354

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53354,101.06H,74,3,2,212,0
1,201510,53354,114.53H,84,3,2,170,0

201510 53492

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53492,110.94A,84,3,2,764,0
1,201510,53492,111.86B,84,3,2,134,0
2,201510,53492,111.90C,84,3,2,130,0

201510 53628

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53628,111.19A,84,3,2,53,0
1,201510,53628,111.87B,84,3,2,58,0
2,201510,53628,111.19C,84,3,2,58,0
3,201510,53628,111.19D,84,3,2,58,0
4,201510,53628,111.46E,84,3,2,20,0
5,201510,53628,111.93F,84,3,2,20,0
6,201510,53628,111.41G,84,3,2,20,0
7,201510,53628,111.41H,84,3,2,20,0

201510 51598

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,51598,107.15,82,3,2,847,0
1,201510,51598,110.35,84,3,2,238,0

201510 53721

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53721,114.69A,84,3,2,55,0
1,201510,53721,115.42B,84,3,2,6,0
2,201510,53721,114.36C,84,3,2,6,0
3,201510,53721,115.18D,84,3,2,6,0
4,201510,53721,115.18E,84,3,2,3,0
5,201510,53721,208.15,176,4,2,14,0
6,201510,53721,241.03,203,4,2,7,0
7,201510,53721,251.76A,213,4,2,7,0
8,201510,53721,251.85B,213,4,2,1,0
9,201510,53721,275.69A,232,4,2,7,0
10,201510,53721,276.37B,232,4,2,2,0

201510 53734

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53734,72.21A,51,2,1,60,0
1,201510,53734,72.42B,51,2,1,185,0
2,201510,53734,83.47A,59,3,2,536,0
3,201510,53734,83.94B,59,3,2,60,0
4,201510,53734,83.96C,59,3,2,151,0
5,201510,53734,93.31A,69,3,2,102,0
6,201510,53734,93.09B,69,3,2,48,0
7,201510,53734,93.48C,69,3,2,296,0
8,201510,53734,111.04A,84,3,2,269,0
9,201510,53734,111.56B,84,3,2,50,0

201510 53389

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53389,75.47A,51,2,2,0,131
1,201510,53389,75.41B,51,2,2,0,66
2,201510,53389,87.10A,59,3,2,0,195
3,201510,53389,87.10B,59,3,2,0,21

201510 53355

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53355,81.24H,59,3,2,7,0
1,201510,53355,101.59H,74,3,2,8,0
2,201510,53355,115.18H,84,3,2,2,0
3,201510,53355,115.18N,84,3,2,0,0

201510 53425

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53425,114.41A,84,3,2,266,0
1,201510,53425,116.13B,84,3,2,153,0
2,201510,53425,115.89C,84,3,2,146,0
3,201510,53425,115.92D,84,3,2,79,0
4,201510,53425,134.30A,99,,0,232,0
5,201510,53425,176.94A,129,,0,5,0
6,201510,53425,179.32B,129,,0,5,0

201510 43334

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,43334,82.37A,59,3,2,134,172
1,201510,43334,82.72B,59,3,2,13,0
2,201510,43334,99.15,75,3,2,68,0
3,201510,43334,110.62A,84,3,2,44,0
4,201510,43334,111.68B,84,3,2,208,0
5,201510,43334,110.73C,84,3,2,106,0
6,201510,43334,153.66,123,4,2,36,0

201510 43332

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,43332,111.12,84,,0,173,0
1,201510,43332,112.06B,84,3,2,490,0
2,201510,43332,111.41C,84,3,2,74,0
3,201510,43332,144.65,111,,0,31,0
4,201510,43332,144.81B,111,,0,17,0
5,201510,43332,145.17C,111,4,2,28,0
6,201510,43332,171.73,134,4,2,1,0

201510 53524

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53524,110.37A,74,3,2,68,0
1,201510,53524,124.39A,84,3,2,54,0
2,201510,53524,124.39A1,84,3,2,18,0

201510 53433

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53433,88.17A,59,3,2,33,0
1,201510,53433,88.56B,59,3,2,60,0
2,201510,53433,89.28C,59,3,2,49,0

201510 53318

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53318,110.82A,84,3,2,388,0
1,201510,53318,111.02B,84,3,2,274,0
2,201510,53318,111.95C,84,3,2,33,0

201510 53761

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53761,84.25,59,3,2,152,0
1,201510,53761,100.58A,74,3,2,222,0
2,201510,53761,101.01B,74,3,2,77,0
3,201510,53761,111.13,84,3,2,256,0

201510 53762

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53762,84.69,59,3,2,206,0
1,201510,53762,100.10A,74,3,2,107,0
2,201510,53762,100.53B,74,3,2,53,0

201510 53788

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53788,112.56A,84,3,2,642,0
1,201510,53788,113.50B,84,3,2,368,0
2,201510,53788,113.05C,84,3,2,368,0
3,201510,53788,112.72D,84,3,2,92,0
4,201510,53788,124.50TA,94,3,2,28,0
5,201510,53788,124.45TB,94,3,2,16,0
6,201510,53788,124.21TC,94,3,2,4,0
7,201510,53788,125.76T,95,3,2,16,0
8,201510,53788,140.59,106,,0,4,0
9,201510,53788,139.90TA,106,3,2,16,0
10,201510,53788,140.17TA,107,3,2,28,0
11,201510,53788,141.43TB,107,3,2,16,0

201510 53329

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53329,99.62A,73,3,2,264,0
1,201510,53329,100.94B,73,3,2,136,0
2,201510,53329,112.70,84,3,2,262,0

201510 53547

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53547,87.02,62,3,2,422,0
1,201510,53547,99.00B,74,3,2,119,0
2,201510,53547,99.91A,74,3,2,224,0
3,201510,53547,111.09,84,,0,660,0

201510 53415

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53415,98.90A,75,3,2,231,0
1,201510,53415,98.82B,75,3,2,115,0
2,201510,53415,108.72A,83,3,2,379,0
3,201510,53415,108.39B,83,3,2,385,0

201510 53795

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53795,60.21A,44,2,1,360,0
1,201510,53795,60.00B,44,2,1,46,0
2,201510,53795,81.54A,59,3,2,168,0
3,201510,53795,89.06A,65,3,2,20,0
4,201510,53795,113.31A,84,3,2,865,0
5,201510,53795,114.85B,84,3,2,76,0
6,201510,53795,113.63C,84,3,2,276,0
7,201510,53795,113.07D,84,3,2,277,0
8,201510,53795,120.70A,90,3,2,87,0
9,201510,53795,122.24B,90,3,2,7,0
10,201510,53795,121.03C,90,3,2,30,0
11,201510,53795,120.46D,90,3,2,26,0
12,201510,53795,131.60A,97,4,2,86,0
13,201510,53795,138.99A,103,5,2,12,0

201510 53654

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53654,99.04A,73,3,2,410,0
1,201510,53654,98.93B,73,3,2,149,0
2,201510,53654,113.20A,84,3,2,801,0
3,201510,53654,113.19B,84,3,2,284,0
4,201510,53654,163.56,123,4,2,30,0
5,201510,53654,166.09,122,4,2,5,0

201510 53717

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53717,117.09A,84,3,2,546,0
1,201510,53717,117.60B,84,3,2,123,0
2,201510,53717,118.25C,84,3,2,219,0
3,201510,53717,131.03,95,3,2,275,0

201510 53356

,sell_ym,no,supply_area,priv_area,room_cnt,bath_cnt,house_cnt,rent_house_cnt
0,201510,53356,71.29A,51,2,1,409,0
1,201510,53356,71.26B,51,2,1,56,0
2,201510,53356,102.86A,74,3,2,200,0
3,201510,53356,116.46A,84,3,2,280,0
4,201510,53356,115.99B,84,3,2,80,0

Program Finised